<a href="https://colab.research.google.com/github/MikeDeecode/Bank-customer-churn-predictiom/blob/master/customer_churn_model.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**USING LOGISTIC REGRESSION TO PREDICT IF A BANK CUSTOMER WILL EXIT OR NOT**

In [55]:
import numpy as np 
import pandas as pd 
import warnings
warnings.filterwarnings("ignore")

print("Setup Complete")

Setup Complete

Import the dataset

In [56]:
customers = pd.read_csv("/content/Bank customers.csv")

print("upload successful")

upload successful

In [57]:
customers.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [58]:
customers['Geography'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

##Data Preprocessing

First I will select my features